# Handling Duplicate Data

In [25]:
import pandas as pd

In [26]:
data = {"name":["a","b","c","d","a","c"],"eng":[8,7,5,8,8,5], "hindi":[2,3,4,5,2,6]}

In [27]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

In [31]:
df.drop_duplicates(inplace = True)

In [32]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6

## Same thing but on Orignal dataset

In [35]:
df = pd.read_csv('Diwali Sales Data.csv',encoding='latin1')
df.head(3)

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
2,1001990,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0,NaN,NaN

In [36]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
11246    False
11247    False
11248    False
11249    False
11250    False
Length: 11251, dtype: bool

In [37]:
df.shape

(11251, 15)

In [38]:
df.drop_duplicates(inplace = True)

In [39]:
df.shape

(11243, 15)